app/controllers/images_controller.rb

SELECT * FROM "images"
---
  def index
    @images = Image.all

SELECT * FROM "images" WHERE ("images"."id" = 1)
---
  def show
    @image = Image.find(params[:id])

SELECT * FROM "albums" WHERE ("albums"."id" = 2)
SELECT * FROM "album_images" WHERE ("album_images".album_id = 2)
SELECT * FROM "images" WHERE (id NOT IN (1,7,3,8))
INSERT INTO "album_images" ("updated_at", "album_id", "image_id", "created_at") VALUES('2010-05-25 10:29:42', NULL, 7, '2010-05-25 10:29:42')
---
  def add_images
   @album = Album.find(params[:album_id] )
   image_ids =  @album.album_images.map &:image_id
   pp image_ids
   #exit
   @images = Image.find(:all,:conditions => [ "id NOT IN (?)", image_ids ]  )





    if request.post?
        album_images = Hash.new
        @image_ids =  params[:album_image][:image_ids]
        album_images[:album_id] = params[:album_id]
        @image_ids.each do |image_id|
        album_images[:image_id] = image_id
        @album_image = AlbumImage.new(album_images)

       @album_image.save

SELECT * FROM "images" WHERE ("images"."id" = 3)
---
  def edit
    @image = Image.find(params[:id])

INSERT INTO "images" ("created_at", "photo_file_size", "title", "album_id", "updated_at", "photo_file_name", "photo_content_type", "short_name") VALUES('2010-05-24 11:07:07', 8530, 'dwfsdfg', 1, '2010-05-24 11:07:07', 'rahul.jpeg', 'image/jpeg', 'dgvs')
INSERT INTO "album_images" ("image_id", "created_at", "album_id", "updated_at") VALUES(5, '2010-05-25 09:09:35', 2, '2010-05-25 09:09:35')
---
  def create
    @image = Image.new(params[:image])

    respond_to do |format|
      if @image.save
            AlbumImage.create(:image_id => @image.id,:album_id => params[:image][:album_id])

SELECT * FROM "images" WHERE ("images"."id" = 12)
UPDATE "images" SET "short_name" = 'htrhrhrrrr', "updated_at" = '2010-05-24 12:47:29' WHERE "id" = 12
---
  def update
    @image = Image.find(params[:id])

    respond_to do |format|
      if @image.update_attributes(params[:image])

SELECT * FROM "images" WHERE ("images"."id" = 5)
DELETE FROM "images" WHERE "id" = 5
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy

SELECT * FROM "albums" WHERE ("albums"."id" = 1)
---
  def find_album
   @album =    Album.find(params[:album_id] )